; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v8 - type_2 ?v6 - type_1)
 	      (pred_3 ?v3 - object ?v6 - type_1)
	      (pred_2 ?v8 - type_2 ?v7 - type_3)
	      (pred_4 ?v8 - type_2 ?v3 - object ?v7 - type_3))

   (:action op_1
       :parameters  (?v8 - type_2 ?v2 ?v1 - type_1)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v1)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_2
       :parameters (?v8 - type_2 ?v4 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v5) (pred_1 ?v8 ?v5) (pred_2 ?v8 ?v7))
       :effect (and (pred_4 ?v8 ?v4 ?v7)
		    (not (pred_3 ?v4 ?v5)) 
		    (not (pred_2 ?v8 ?v7))))

   (:action op_3
       :parameters (?v8 - type_2 ?v4 - object ?v5 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v4 ?v7) (pred_1 ?v8 ?v5))
       :effect (and (pred_3 ?v4 ?v5)
		    (pred_2 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v4 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_01 - type_2
obj_12 obj_06 obj_04 obj_10 - type_3
obj_08 obj_05 obj_02 - type_1
obj_11 obj_09 obj_07 - object)
(:init
(pred_1 obj_03 obj_08)
(pred_2 obj_03 obj_12)
(pred_2 obj_03 obj_06)
(pred_1 obj_01 obj_05)
(pred_2 obj_01 obj_04)
(pred_2 obj_01 obj_10)
(pred_3 obj_11 obj_05)
(pred_3 obj_09 obj_08)
(pred_3 obj_07 obj_08)
)
(:goal
(and
(pred_3 obj_11 obj_08)
(pred_3 obj_09 obj_02)
(pred_3 obj_07 obj_05)
)
)

(:constraints
  (always (not (pred_1 obj_03 obj_02)))
)
)

; plan
1. (op_1 obj_03 obj_08 obj_05)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_05)
   goals met: 0 of 3
2. (op_2 obj_01 obj_11 obj_05 obj_10)
   deleted: (pred_3 obj_11 obj_05) (pred_2 obj_01 obj_10)
   added: (pred_4 obj_01 obj_11 obj_10)
   goals met: 0 of 3
3. (op_1 obj_01 obj_05 obj_08)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_08)
   goals met: 0 of 3
4. (op_1 obj_03 obj_05 obj_08)
   deleted: (pred_1 obj_03 obj_05)
   added: (pred_1 obj_03 obj_08)
   goals met: 0 of 3
5. (op_3 obj_01 obj_11 obj_08 obj_10)
   deleted: (pred_4 obj_01 obj_11 obj_10)
   added: (pred_3 obj_11 obj_08) (pred_2 obj_01 obj_10)
   goals met: 1 of 3
6. (op_2 obj_01 obj_09 obj_08 obj_04)
   deleted: (pred_3 obj_09 obj_08) (pred_2 obj_01 obj_04)
   added: (pred_4 obj_01 obj_09 obj_04)
   goals met: 1 of 3
7. (op_2 obj_03 obj_07 obj_08 obj_06)
   deleted: (pred_3 obj_07 obj_08) (pred_2 obj_03 obj_06)
   added: (pred_4 obj_03 obj_07 obj_06)
   goals met: 1 of 3
8. (op_1 obj_01 obj_08 obj_02)
   deleted: (pred_1 obj_01 obj_08)
   added: (pred_1 obj_01 obj_02)
   goals met: 1 of 3
9. (op_1 obj_03 obj_08 obj_05)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_05)
   goals met: 1 of 3
10. (op_3 obj_01 obj_09 obj_02 obj_04)
   deleted: (pred_4 obj_01 obj_09 obj_04)
   added: (pred_3 obj_09 obj_02) (pred_2 obj_01 obj_04)
   goals met: 2 of 3
11. (op_3 obj_03 obj_07 obj_05 obj_06)
   deleted: (pred_4 obj_03 obj_07 obj_06)
   added: (pred_3 obj_07 obj_05) (pred_2 obj_03 obj_06)
   goals met: 3 of 3
